{
  "Metadata": {
    "common": {
      "applicationName": "Jiří Poledník - Portfolio",
      "keywords": "developer, web developer, web designer, web development, web design, portfolio, Jiří Poledník, Jiří, Poledník, Jiří Poledník Portfolio, Jiří Poledník Web Developer, Jiří Poledník Web Designer, Jiří Poledník Web Development, Jiří Poledník Web Design",
      "authors": "Jiří Poledník",
      "publisher": "Jiří Poledník"
    },
    "homepage": {
      "title": "Jiří Poledník - Portfolio",
      "description": "Jiří Poledník - Portfolio"
    },
    "web2": {
      "title": "Web 2.0",
      "description": "Web 2.0 - the web we know"
    },
    "web3": {
      "title": "Web 3.0",
      "description": "Web 3.0 - the web we deserve"
    }
  },
  "Header": {
    "web2": "Web Development",
    "web3": "Decentralized Applications",
    "home": "Home"
  },
  "HomePage": {
    "title": "About Me",
    "description": {
      "one": "I am a passionate web developer with a strong background in frontend and backend technologies. My journey in the tech industry began with a keen interest in web development, which has since evolved into a full-fledged career.",
      "two": "I have worked on a variety of projects, ranging from e-commerce platforms to content management systems, and have gained valuable experience in both frontend and backend development. My expertise lies in crafting engaging user interfaces and building scalable web applications that meet the unique needs of clients.",
      "three": "I am always eager to learn new technologies and stay up-to-date with the latest trends in web development. I am excited about the future of the web and look forward to contributing to the next generation of digital experiences."
    },
    "welcome": "Building the future layer by layer",
    "subtitle": "Web Developer | Web Designer | Web Development | Web Design",
    "explore": "Explore My Work",
    "web2": "Web Development",
    "web3": "Decentralized Applications",
    "contact": "Contact Me",
    "email": "email: jirkapolednik@gmail.com",
    "socials": "Socials",
    "linkedinLink": "https://www.linkedin.com/in/jiri-polednik/",
    "githubLink": "https://github.com/Jiri-Polednik"
  },
  "Web2": {
    "Anewgo": {
      "title": "Anewgo - Frontend Developer",
      "period": "November 2021 - October 2022",
      "description": {
        "one": "At Anewgo, my role as a Frontend Developer involved crafting an engaging interface for an online platform aimed at simplifying real estate transactions. This platform serves as a key tool for U.S. homeowners and real estate professionals.",
        "two": "I utilized React to build dynamic user interfaces, ensuring that the platform was both intuitive and efficient for users. My contributions were critical in facilitating smooth and secure property listings and transactions.",
        "three": "The technologies I employed included advanced frameworks and tools such as React Query and JavaScript, which helped in optimizing data handling and UI responsiveness."
      },
      "technologies": "React, React Query, JavaScript, HTML, CSS, Git, Jira, Confluence",
      "link": "https://anewgo.com/"
    },
    "Ondrasek": {
      "title": "Ondrášek - Fullstack Developer",
      "period": "November 2022 - August 2023",
      "description": {
        "one": "During my tenure with Ondrášek, I developed a robust content management system (CMS) for managing digital content related to printing machine spare parts.",
        "two": "The project not only enhanced the operational capabilities of the CMS but also laid the groundwork for the initial development phase of an e-commerce platform tailored for the business's unique needs.",
        "three": "My work involved using modern web technologies such as NextJS and TypeScript, enhancing site manageability and scalability."
      },
      "technologies": "React, TypeScript, JavaScript, GraphQL, NextJS, HTML, CSS, Git",
      "link": "https://www.ondrasek.cz/"
    },
    "eMetsa": {
      "title": "eMetsa - Frontend Developer",
      "period": "December 2023 - Present",
      "description": {
        "one": "As part of the eMetsa project, I focused on transforming forest management in Finland by developing a user-friendly digital interface.",
        "two": "My contributions included the integration of financial planning tools and real-time analytics, which significantly aided forest owners in making informed decisions about their properties.",
        "three": "This role utilized my skills in React and TypeScript, along with my knowledge of Node.js and Azure DevOps, to create a seamless user experience across various digital platforms."
      },
      "technologies": "React, TypeScript, JavaScript, Node.js, Azure DevOps, HTML, CSS, Git"
    },
    "PackDesigner": {
      "title": "PackDesigner - Full Stack Developer",
      "period": "August 2023 - Present",
      "description": {
        "one": "In my role as Full Stack Developer for PackDesigner, I spearheaded the development of a new packaging design application, blending innovative design with technical functionality.",
        "two": "I leveraged technologies such as ThreeJS and React Fibre to create detailed and interactive 3D visualizations of packaging designs, enabling users to visualize changes in real-time.",
        "three": "The backend was powered by Node.JS with Azure serverless functions, which I managed to ensure high performance and scalability."
      },
      "technologies": "React, TypeScript, JavaScript, React Fibre, ThreeJS, Drei, Node.JS, Azure DevOps, HTML, CSS, Git"
    }
  },
  "Web3": {
    "HodlMePlease": {
      "title": "HodlMePlease - Blockchain Developer",
      "period": "May 2024 - Present",
      "description": {
        "one": "I have created my own token on the Solana blockchain called HodlMePlease.",
        "two": "The token is based around internet memes and aims to provide a fun and engaging experience for users."
      },
      "technologies": "Solana, Web3.js, React, TypeScript, JavaScript, HTML, CSS, Git"
    },
    "DecentralDice": {
      "title": "DecentralDice - Smart Contract Developer",
      "period": "May 2024 - Present",
      "description": {
        "one": "DecentralDice is a decentralized application (dApp) that allows users to play various games of chance using blockchain technology.",
        "two": "I am developing the smart contracts for the game, ensuring that they are secure, efficient, and tamper-proof."
      },
      "technologies": "Ethereum, Solidity, Web3.js, React, TypeScript, JavaScript, HTML, CSS, Git"
    }
  },
  "Footer": {
    "brandName": "Jiří Poledník",
    "tagline": "Building the future layer by layer",
    "poweredBy": "Powered by Jiří Poledník",
    "copyright": "Copyright ©2024 Jiří Poledník",
    "linkedinLink": "https://www.linkedin.com/in/jiri-polednik/",
    "githubLink": "https://github.com/Jiri-Polednik"
  }
}
